In [4]:
import pandas as pd

df = pd.read_csv("employees.csv")

df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null category
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null datetime64[ns]
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    1000 non-null bool
Team                 957 non-null object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.0+ KB

In [21]:
49.0/62.2

0.7877813504823151

In [6]:
df["Start Date"].head()

0     8/6/1993
1    3/31/1996
2    4/23/1993
3     3/4/2005
4    1/24/1998
Name: Start Date, dtype: object

In [8]:
pd.to_datetime(df["Start Date"])

df["Start Date"] = pd.to_datetime(df["Start Date"])

In [10]:
df["Last Login Time"].head()

0    12:42 PM
1     6:53 AM
2    11:17 AM
3     1:00 PM
4     4:47 PM
Name: Last Login Time, dtype: object

In [12]:
pd.to_datetime(df["Last Login Time"])
df["Last Login Time"]= pd.to_datetime(df["Last Login Time"])

In [15]:
df["Senior Management"].head()

0     True
1     True
2    False
3     True
4     True
Name: Senior Management, dtype: object

In [17]:
df["Senior Management"].astype("bool")

df["Senior Management"] = df["Senior Management"].astype("bool")

In [19]:
df["Gender"].astype("category")

df["Gender"] = df["Gender"].astype("category")

In [24]:
import pandas as pd

df = pd.read_csv("employees.csv", parse_dates=["Start Date","Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")

df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2018-12-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2018-12-23 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2018-12-23 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2018-12-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2018-12-23 16:47:00,101004,1.389,True,Client Services

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null category
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null datetime64[ns]
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    1000 non-null bool
Team                 957 non-null object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.0+ KB